# LAB 2

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
# 1. Write the command to read this data in the dataframe.
df = pd.read_csv('RSData.csv', na_values=['NA', 'n/a', 'na', 'NaN', 'nil'])

In [3]:
df.head()

,propertyid,stno,stname,owneroccupied,numbedrooms,numbathrooms,areasqft
0,100001000.0,10.0,Kranti Road,Y,3.0,1,1000
1,100002000.0,17.0,Bhagat Singh Road,N,3.0,1.5,nil
2,100003000.0,NaN,Bhagat Singh Road,N,NaN,1,850
3,100004000.0,20.0,Azad Marg,12,1.0,NaN,700
4,NaN,23.0,Azad Marg,Y,3.0,2,1600

In [4]:
# 2. List number of rows and columns in this dataset 
print('Number of rows, columns: ' + str(df.shape))

Number of rows, columns: (9, 7)

In [5]:
# 3. Check if there is any missing value in this entire dataset? 
df.isnull().sum()

propertyid       1
stno             2
stname           0
owneroccupied    1
numbedrooms      3
numbathrooms     1
areasqft         1
dtype: int64

In [6]:
# 4. Which column(s) does not have any missing value? 
print('Columns without missing value')
for cols in df.columns:
    if df[cols].isnull().sum() == 0:
        print(cols)

Columns without missing value
stname

In [7]:
# 5. Which columns have maximum number of missing values? 
print('Column having maximum number of missing values: ')
df.count().idxmin()

Column having maximum number of missing values:

'numbedrooms'

In [8]:
# 6. There are how many rows, which does not have any missing value(s)?
rowswithna = sum([True for idx,row in df.iterrows() if any(row.isnull())])
rowswithoutna = len(df) - rowswithna
print('Rows that does not have any missing value(s): ' + str(rowswithoutna))

Rows that does not have any missing value(s): 2

In [9]:
# 7. If there is any missing value in the “areasqft” replace it with 900 
df['areasqft'] = df['areasqft'].fillna(900)
df.tail()

,propertyid,stno,stname,owneroccupied,numbedrooms,numbathrooms,areasqft
4,NaN,23.0,Azad Marg,Y,3.0,2,1600
5,100006000.0,20.0,Azad Marg,Y,NaN,1,800
6,100007000.0,NaN,Shivaji Road,NaN,2.0,Surya,950
7,100008000.0,13.0,Netaji Marg,Y,1.0,1,900
8,100009000.0,15.0,Netaji Marg,Y,NaN,2,1800

In [10]:
# 8. Fill the street number of record at index 2 with 77
df['stno'].loc[df.index[2]] = 77
df.head()

C:\Users\HP\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

,propertyid,stno,stname,owneroccupied,numbedrooms,numbathrooms,areasqft
0,100001000.0,10.0,Kranti Road,Y,3.0,1,1000
1,100002000.0,17.0,Bhagat Singh Road,N,3.0,1.5,nil
2,100003000.0,77.0,Bhagat Singh Road,N,NaN,1,850
3,100004000.0,20.0,Azad Marg,12,1.0,NaN,700
4,NaN,23.0,Azad Marg,Y,3.0,2,1600

In [11]:
# 9. If there is any missing value in the “number of bedrooms” columns, then replace it with the median value of this column
df['numbedrooms'] = df['numbedrooms'].fillna(np.nanmedian(df['numbedrooms']))
df.head()

,propertyid,stno,stname,owneroccupied,numbedrooms,numbathrooms,areasqft
0,100001000.0,10.0,Kranti Road,Y,3.0,1,1000
1,100002000.0,17.0,Bhagat Singh Road,N,3.0,1.5,nil
2,100003000.0,77.0,Bhagat Singh Road,N,2.5,1,850
3,100004000.0,20.0,Azad Marg,12,1.0,NaN,700
4,NaN,23.0,Azad Marg,Y,3.0,2,1600

In [12]:
# 10. Give your comment on the “owner occupied” column. 
df['owneroccupied'].value_counts()

Y     5
N     2
12    1
Name: owneroccupied, dtype: int64

'owneroccupied' is a categorical variable.
Most of the RS are owner occupied.

In [13]:
# 11. It is believed that the data entry operator might have entered integer values in “owner occupied” column. Count number of such entries and replace them with numpy standard nan (np.nan)
df['owneroccupied'].value_counts()
df['owneroccupied'].loc[df.index[3]] = np.nan

C:\Users\HP\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [14]:
df.head()

,propertyid,stno,stname,owneroccupied,numbedrooms,numbathrooms,areasqft
0,100001000.0,10.0,Kranti Road,Y,3.0,1,1000
1,100002000.0,17.0,Bhagat Singh Road,N,3.0,1.5,nil
2,100003000.0,77.0,Bhagat Singh Road,N,2.5,1,850
3,100004000.0,20.0,Azad Marg,NaN,1.0,NaN,700
4,NaN,23.0,Azad Marg,Y,3.0,2,1600